## Структура данных DataFrame

In [1]:
import pandas as pd
import numpy as np

DataFrame - двумерная структура данных библиотеки Pandas

Создадим DataFrame:

In [2]:
df = pd.DataFrame({'Col1':['a','b','c','d','e','f','g','h'], 'Col2':[1,3,5,7,9,11,13,15]}, columns=['Col1', 'Col2'])
df

  Col1  Col2
0    a     1
1    b     3
2    c     5
3    d     7
4    e     9
5    f    11
6    g    13
7    h    15

Просмотрим информацию о DataFrame:

In [3]:
df.shape

(8, 2)

In [4]:
df.columns

Index(['Col1', 'Col2'], dtype='object')

In [5]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
Col1    8 non-null object
Col2    8 non-null int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [7]:
df.describe()

            Col2
count   8.000000
mean    8.000000
std     4.898979
min     1.000000
25%     4.500000
50%     8.000000
75%    11.500000
max    15.000000

In [8]:
#по умолчанию 5
df.head()

  Col1  Col2
0    a     1
1    b     3
2    c     5
3    d     7
4    e     9

In [9]:
df.head(2)

  Col1  Col2
0    a     1
1    b     3

In [11]:
df['Col1'].head()

0    a
1    b
2    c
3    d
4    e
Name: Col1, dtype: object

In [12]:
df.Col1.head()

0    a
1    b
2    c
3    d
4    e
Name: Col1, dtype: object

In [13]:
df.tail()

  Col1  Col2
3    d     7
4    e     9
5    f    11
6    g    13
7    h    15

Изменение индекса:

In [15]:
df.index = [2,4,6,8,10,12,14,16]
df

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

Выбор данных по индексу:

In [16]:
#Сначала индекс строки, а потом название столбца
df.loc[2, 'Col1']

'a'

In [17]:
#Выбираются все столбцы
df.loc[2, :]

Col1    a
Col2    1
Name: 2, dtype: object

In [18]:
#Все строки от 2 до 4 включительно
df.loc[2:4, :]

  Col1  Col2
2    a     1
4    b     3

Выбор данных по позиции:

In [19]:
df

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

In [20]:
#Срез по 0 строке
df.iloc[0,:]

Col1    a
Col2    1
Name: 2, dtype: object

In [21]:
#Верхня граница не включается, будут выбираться 0 и 1 строки
df.iloc[0:2,:]

  Col1  Col2
2    a     1
4    b     3

In [22]:
df.iloc[0:2,0]

2    a
4    b
Name: Col1, dtype: object

Выбор по условию:

In [24]:
df.loc[df['Col1'] == 'b', :]

  Col1  Col2
4    b     3

In [25]:
df.loc[df['Col1'] == 'b', 'Col2']

4    3
Name: Col2, dtype: int64

In [26]:
# Вывод в виде многомерного массива NumPy
df.loc[df['Col1'] == 'b', 'Col2'].values

array([3])

In [27]:
df.loc[df['Col2'] > 10, 'Col1']

12    f
14    g
16    h
Name: Col1, dtype: object

In [28]:
df.loc[(df['Col2'] > 10) & (df['Col1'] != 'g'), :]

   Col1  Col2
12    f    11
16    h    15

In [30]:
df.loc[(df['Col2'] > 10) | (df['Col2']%9 == 0), :]

   Col1  Col2
10    e     9
12    f    11
14    g    13
16    h    15

In [32]:
df.loc[df['Col2'].between(11,13), :]

   Col1  Col2
12    f    11
14    g    13

In [33]:
df.loc[df['Col1'].isin(['a','b','c','d','e']), :]

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9

In [34]:
# ~ - отрицание
df.loc[~df['Col1'].isin(['a','b','c','d','e']), :]

   Col1  Col2
12    f    11
14    g    13
16    h    15

Метод query:

In [35]:
df

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

In [36]:
df.query('Col1 == "b"')

  Col1  Col2
4    b     3

In [37]:
df.query('Col2 > 10')

   Col1  Col2
12    f    11
14    g    13
16    h    15

Столбец DataFrame в виде Series

In [38]:
s = df['Col1']
s

2     a
4     b
6     c
8     d
10    e
12    f
14    g
16    h
Name: Col1, dtype: object

In [39]:
type(s)

pandas.core.series.Series

Получение DataFrame из Series

In [40]:
df2 = pd.DataFrame(s)
df2

   Col1
2     a
4     b
6     c
8     d
10    e
12    f
14    g
16    h

Копирование DataFrame

In [41]:
df_copy = df.copy()
df_copy

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

Случайный выбор n-го количества строк

In [42]:
df.sample(n=2)

   Col1  Col2
16    h    15
6     c     5

Случайный выбор доли от исходного DataFrame

In [43]:
df.sample(frac=0.5)

   Col1  Col2
4     b     3
2     a     1
14    g    13
12    f    11

Случайный выбор с возвращением (строки могут повторяться)

In [44]:
df.sample(frac=0.5, replace = True)

   Col1  Col2
14    g    13
8     d     7
12    f    11
10    e     9

Случайное перемешивание

In [49]:
# random_state - для воспроизводимости перемешивания
df.sample(frac=1.0, random_state = 42)

   Col1  Col2
4     b     3
12    f    11
2     a     1
16    h    15
6     c     5
10    e     9
8     d     7
14    g    13

Запись и чтение DataFrame в csv

In [47]:
# sep - разделитель данных (по умолчанию запятая), index = False - индекс DataFrame не будет записан
df.to_csv('Test.csv', sep = ';', index = False)

In [48]:
df_new = pd.read_csv('Test.csv', sep = ';')
df_new

  Col1  Col2
0    a     1
1    b     3
2    c     5
3    d     7
4    e     9
5    f    11
6    g    13
7    h    15

Запись в excel и pickle - с помощью методов to_excel, to_pickle.

Чтение - read_excel, read_pickle

## Работа с данными в DataFrame

### Слияние данных

In [52]:
authors = pd.DataFrame({'author_id':[1,2,3], 'author_name':['Pushkin', 'Tolstoy', 'Dostoevsky']}, 
                       columns = ['author_id', 'author_name'])
authors

   author_id author_name
0          1     Pushkin
1          2     Tolstoy
2          3  Dostoevsky

In [57]:
books = pd.DataFrame({'author_id':[2,3,3,4], 
                      'book_title':['War and Piece', 'The Idiot', 'Crime and Punishment', 'Fathers and Sons']})
books

   author_id            book_title
0          2         War and Piece
1          3             The Idiot
2          3  Crime and Punishment
3          4      Fathers and Sons

Merge

In [58]:
# Inner Merge
df1 = pd.merge(authors, books, on = 'author_id', how = 'inner')
df1

   author_id author_name            book_title
0          2     Tolstoy         War and Piece
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  Crime and Punishment

In [59]:
# Left Merge
df2 = pd.merge(authors, books, on = 'author_id', how = 'left')
df2

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Piece
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment

In [60]:
# Right Merge
df3 = pd.merge(authors, books, on = 'author_id', how = 'right')
df3

   author_id author_name            book_title
0          2     Tolstoy         War and Piece
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  Crime and Punishment
3          4         NaN      Fathers and Sons

In [61]:
# Outer Merge
df4 = pd.merge(authors, books, on = 'author_id', how = 'outer')
df4

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Piece
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

Работа с пропущенными данными

In [63]:
df4.loc[df4['book_title'].isnull(),:]

   author_id author_name book_title
0          1     Pushkin        NaN

In [65]:
df4.loc[df4['author_name'].notnull(),:]

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Piece
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment

In [66]:
df4['book_title'] = df4['book_title'].fillna('unknown')
df4

   author_id author_name            book_title
0          1     Pushkin               unknown
1          2     Tolstoy         War and Piece
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

In [67]:
df4['author_name'].fillna('unknown', inplace=True)
df4

   author_id author_name            book_title
0          1     Pushkin               unknown
1          2     Tolstoy         War and Piece
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4     unknown      Fathers and Sons

### Добавление столбцов

In [69]:
df4.loc[(df4['author_name'] != 'unknown') & (df4['book_title'] != 'unknown'), 'quantity'] = 1
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       NaN
1          2     Tolstoy         War and Piece       1.0
2          3  Dostoevsky             The Idiot       1.0
3          3  Dostoevsky  Crime and Punishment       1.0
4          4     unknown      Fathers and Sons       NaN

In [70]:
df4['quantity'].fillna(0, inplace=True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       0.0
1          2     Tolstoy         War and Piece       1.0
2          3  Dostoevsky             The Idiot       1.0
3          3  Dostoevsky  Crime and Punishment       1.0
4          4     unknown      Fathers and Sons       0.0

In [72]:
df4['quantity'] = df4['quantity'].astype(int)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Piece         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

In [73]:
df4.set_index('author_id', inplace=True)
df4

          author_name            book_title  quantity
author_id
1             Pushkin               unknown         0
2             Tolstoy         War and Piece         1
3          Dostoevsky             The Idiot         1
3          Dostoevsky  Crime and Punishment         1
4             unknown      Fathers and Sons         0

In [74]:
df4.reset_index(inplace=True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Piece         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

### Удаление данных

Сначала добавим новый столбец:

In [78]:
df4['price'] = 500
df4

   author_id author_name            book_title  quantity  price
0          1     Pushkin               unknown         0    500
1          2     Tolstoy         War and Piece         1    500
2          3  Dostoevsky             The Idiot         1    500
3          3  Dostoevsky  Crime and Punishment         1    500
4          4     unknown      Fathers and Sons         0    500

Удалим столбец:

In [79]:
# axis = 1 - значит, что мы хотим удалить столбец
df4 = df4.drop('price', axis = 1)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Piece         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

Удалим строку (по значению индекса):

In [80]:
# axis = 0 - значит, что мы хотим удалить строку
df4 = df4.drop(1, axis = 0)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

### Сортировка

Вернем удаленную строку:

In [81]:
df4 = df4.append(pd.DataFrame({'author_id':[2],
                               'author_name':['Tolstoy'],
                               'book_title':['War and Piece'],
                               'quantity':[1]},
                             columns = ['author_id','author_name','book_title','quantity']), ignore_index=True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          3  Dostoevsky             The Idiot         1
2          3  Dostoevsky  Crime and Punishment         1
3          4     unknown      Fathers and Sons         0
4          2     Tolstoy         War and Piece         1

Отсортируем по столбцу author_id:

In [82]:
df4 = df4.sort_values(by='author_id')
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
4          2     Tolstoy         War and Piece         1
1          3  Dostoevsky             The Idiot         1
2          3  Dostoevsky  Crime and Punishment         1
3          4     unknown      Fathers and Sons         0

Переустановим индекс:

In [83]:
df4 = df4.reset_index(drop=True)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Piece         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

### Соединение DataFrame

Конкатенация по оси 0 (добавление новых строк):

In [84]:
# Сначала создадим новый DataFrame
df5 = pd.DataFrame({'author_id':[3,5], 'author_name':['Dostoevsky','Chekhov'], 
                    'book_title':['The Gambler', 'Three sisters'], 'quantity':[2,3]}, 
                       columns = ['author_id','author_name','book_title','quantity'])
df5

   author_id author_name     book_title  quantity
0          3  Dostoevsky    The Gambler         2
1          5     Chekhov  Three sisters         3

In [85]:
df6 = pd.concat([df4, df5], axis=0, ignore_index=True)
df6

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Piece         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0
5          3  Dostoevsky           The Gambler         2
6          5     Chekhov         Three sisters         3

Конкатенация по оси 1 (добавление новых столбцов):

In [86]:
prices = pd.DataFrame({'price':[700, 450, 500, 400, 350]}, columns=['price'], index=[1,2,3,5,6])
prices

   price
1    700
2    450
3    500
5    400
6    350

In [87]:
df7 = pd.concat([df6, prices], axis=1)
df7

   author_id author_name            book_title  quantity  price
0          1     Pushkin               unknown         0    NaN
1          2     Tolstoy         War and Piece         1  700.0
2          3  Dostoevsky             The Idiot         1  450.0
3          3  Dostoevsky  Crime and Punishment         1  500.0
4          4     unknown      Fathers and Sons         0    NaN
5          3  Dostoevsky           The Gambler         2  400.0
6          5     Chekhov         Three sisters         3  350.0

### Применение функций и методов

In [88]:
df7['total'] = df7['quantity'] * df7['price']
df7

   author_id author_name            book_title  quantity  price   total
0          1     Pushkin               unknown         0    NaN     NaN
1          2     Tolstoy         War and Piece         1  700.0   700.0
2          3  Dostoevsky             The Idiot         1  450.0   450.0
3          3  Dostoevsky  Crime and Punishment         1  500.0   500.0
4          4     unknown      Fathers and Sons         0    NaN     NaN
5          3  Dostoevsky           The Gambler         2  400.0   800.0
6          5     Chekhov         Three sisters         3  350.0  1050.0

In [89]:
df7['price'].max()

700.0

In [90]:
df7['price'].min()

350.0

In [91]:
df7['price'].mean()

480.0

In [92]:
df7['price'].median()

450.0

In [93]:
df7['price'].std()

135.09256086106296

In [94]:
df7['price'].var()

18250.0

In [96]:
# Вывести 3 max цены
df7.nlargest(3, 'price')

   author_id author_name            book_title  quantity  price  total
1          2     Tolstoy         War and Piece         1  700.0  700.0
3          3  Dostoevsky  Crime and Punishment         1  500.0  500.0
2          3  Dostoevsky             The Idiot         1  450.0  450.0

In [97]:
# Вывести уникальные значения
df7['author_name'].unique()

array(['Pushkin', 'Tolstoy', 'Dostoevsky', 'unknown', 'Chekhov'],
      dtype=object)

In [98]:
# Вывести количество уникальных значений
df7['author_name'].nunique()

5

In [99]:
df7['author_name'].value_counts()

Dostoevsky    3
unknown       1
Tolstoy       1
Chekhov       1
Pushkin       1
Name: author_name, dtype: int64

Построчное применение методов и функций:

In [101]:
df7['book_title'].apply(lambda x: x.upper())

0                 UNKNOWN
1           WAR AND PIECE
2               THE IDIOT
3    CRIME AND PUNISHMENT
4        FATHERS AND SONS
5             THE GAMBLER
6           THREE SISTERS
Name: book_title, dtype: object

### Группировка данных

1-й способ:

In [102]:
# Узнаем максимальную цену по каждому автору
df7.groupby('author_name')['price'].max()

author_name
Chekhov       350.0
Dostoevsky    500.0
Pushkin         NaN
Tolstoy       700.0
unknown         NaN
Name: price, dtype: float64

2-й способ:

In [103]:
price_agg = df7.groupby('author_name').agg({'price':'max'})
price_agg

             price
author_name
Chekhov      350.0
Dostoevsky   500.0
Pushkin        NaN
Tolstoy      700.0
unknown        NaN

In [104]:
price_agg = price_agg.reset_index()
price_agg = price_agg.rename(columns = {'price':'max_price'})
price_agg

  author_name  max_price
0     Chekhov      350.0
1  Dostoevsky      500.0
2     Pushkin        NaN
3     Tolstoy      700.0
4     unknown        NaN